% 采用DP算法求解输气管道末段非稳态优化问题

% 代码初始化
clc;clear;
Pin = 3.5E6;            %压缩机入口压力
Pe_min = 4.5E6;         %管段出口允许最低压力
Ps_max = 7.3E6;         %管段进口允许最高压力
Qbasic = 65;            %基础流量，m^3/s
Ff = [0.2;0.15;0.1;0.25;0.35;0.58;1.2;1.3;1;0.97;0.85;1.65;2;1;0.8;0.65;...
    1.15;1.9;2.8;2.2;1.2;0.85;0.5;0.35];    %小时不均匀用气系数
Qe = Qbasic*Ff;         %管段末端流量需求

mol = 17.44;            %相对分子质量
R = 8314;               %通用气体常数
PreC = 46.59E5;         %气体视临界压力
TempC = 198.19;         %气体视临界温度
Temp = 15+273.15;       %输气温度
Den_air = 1.209;        %空气标况下的密度，kg/m^3
Temp_sta = 20+273.15;   %标况温度
Pre_sta = 101325;       %标况压力
Rel_Den = 0.6;          %相对密度
Den_sta = Rel_Den*Den_air;  %标况气体密度
alpha = Den_sta*Temp_sta/Pre_sta/Temp;  %通用气体状态方程参数
beta = 0.257/PreC - 0.533*TempC/PreC/Temp;  %AGA气体状态方程参数

Len = 100E3;            %管道长度，m
dt = 3600;              %时间步长，s
dp = 0.1E6;             %状态变量空间离散步长
dx = 2E3;               %稳态模拟时空间步长，m
lamda = 0.008;          %摩阻系数
Din = 0.6096;           %管内径，m
a = [4.4889;0.071;-0.009];  %压缩机压头-流量曲线系数
b = [9.0719;2.2055;-0.0161];%压缩机效率-流量曲线系数

C0 = 0.03848;           %稳态模拟公式参数

%DP算法初始化-设置初始状态
tl = Len;               %稳态模拟
Ple = Pe_min;           %稳态模拟划分管段末端压力
while tl>0              %求解压气站出口压力
    z = 1 + beta*Ple;   %管段终点压缩因子
    Pls = Ple^2 + lamda*z*Rel_Den*Temp*dx*Qe(24)^2/C0^2/Din^5;
    Pls = Pls^0.5;
    tl = tl - dx;
    Ple = Pls;
end
Ps = Pls;               %管段起点压力
Mss = Den_sta*Qe(24);   %点质量流量密度
Pe = Pe_min;            %管段终点压力
Mse = Den_sta*Qe(24);   %质量流量密度

%DP算法顺序递推过程
for i = 1:24
    
end








